import { View } from '@tarojs/components';

import styles from './index.module.less';

const ServiceAgreement = () => {
  return (
    <View className={styles.container}>
      <View className={styles.title}>用户服务协议</View>



      <View className={styles.li}>
        1、特别提醒
      </View>
      <View className={styles.li}>
        在使用本小程序之前，您需要仔细阅读本协议，同时我们已对与您的权益可能具有重大关系的条款用粗体字予以标注，您需要重点阅读。
      </View>
      <View className={styles.li}>
        您同意并确认，在您注册成为会员前或使用、接受我们提供的服务前，您已充分阅读、理解并接受本协议的全部内容，每当您使用本服务或者网站、小程序，都表示您已同意接受本协议的约束。
      </View>
      <View className={styles.li}>您同意并确认，有权根据需要不时地修改、制定本协议，并以公告的方式在本服务或者网站、小程序上予以公示；
      </View>
      <View className={styles.li}>若您在本协议内容公告变更后继续使用本服务或者网站、小程序，表示您已充分阅读、理解修改后的协议内容，并视为您已接受新的服务协议；若您不同意修改后的协议内容，您应当立即停止使用本服务或者网站、小程序。
      </View>
      <View className={styles.li}>2、注册条款
      </View>
      <View className={styles.li}>您理解并同意，本服务或者网站、小程序仅限个人用户注册。

      </View>
      <View className={styles.li}>在您通过本服务或者网站、小程序注册个人用户时，您应当是具有法律规定的完全民事权利能力和民事行为能力，能够独立承担民事责任的自然人。若您不具备前述主体资格，您应当立即停止注册或停止使用的服务，由此导致的一切后果由您及您的监护人承担。
      </View>
      <View className={styles.li}>当您通过本服务或者网站、小程序申请注册成为的会员时，您需要提供您的手机号。
      </View>
      <View className={styles.li}>若您注册成为的会员或使用、接受的服务，您同意：
      </View>
      <View className={styles.li}>在注册时，向提供真实、准确、即时、完整的注册信息及相应的证件资料并及时更新上述信息及资料以保持其真实、准确、即时、完整。我们将根据您的信息，为您匹配可能合适您的岗位，将您推荐给可能合适的招聘者。您的个人信息（包括手机号、电子邮箱、微信号）在您没有主动或同意交换的情况下，不会展示给其他用户。

      </View>
      <View className={styles.li}>在查看或推荐附近职位、邀约线下面试、填写职位及家庭地址等场景中，我们会收集您的位置信息，以更好地为您提供求职、招聘功能以及与位置有关的产品或服务。我们在首次会通过弹窗申请获取您的位置信息（GPS定位）；经您授权同意后，再获取您的位置权限，例如您所在的城市、地区等。我们承诺仅会在您主动使用相关功能时获取您的位置信息，仅按照提供相关服务所需的最低频率收集您的位置信息，不会追踪您的行踪轨迹。如果拒绝授权，您可以选择手动输入目标求职地点或使用不需要位置信息的招聘或求职功能，但不影响您使用不基于位置的其他服务。
      </View>
      <View className={styles.li}>在确知或者有合理理由怀疑您提供的信息不真实、不准确、不即时、不完整时，有权暂停或终止对您的服务。
      </View>
      <View className={styles.li}>因通过您提供的电子邮件地址、手机或座机号码等联系方式无法及时与您取得联系，导致您在使用本服务或者网站、小程序服务过程中产生任何损失或增加费用的，由您自行承担。
      </View>
      <View className={styles.li}>您在使用本服务或者网站、小程序时,授权有权以各种方式（包括但不限于电子邮件、手机短信）发送与所提供服务相关的各类商业信息，如您拒绝继续接收上述商业信息，您可以选择退订方式通知。


      </View>
      <View className={styles.li}>3、账号管理
      </View>
      <View className={styles.li}>会员账号管理
      </View>
      <View className={styles.li}>在您完成的会员注册程序或以允许的其他方式实际使用本服务或者网站、小程序的服务时，会向您提供唯一ID号的账号（以下亦称“账号”）。您可以对账号设置用户名、密码，通过该用户名、密码或经授权的其他关联或合作网站的用户名密码登录触屏端、小程序。您设置的用户名不得违反法律规定、不得侵犯他人合法权益。
      </View>
      <View className={styles.li}>您应当妥善保管您的用户名和密码，对于因密码泄露所致的损失，由您自行承担。您保证不向其他任何人泄露用户名及密码，如您发现任何人冒用或盗用您的用户名及密码或有任何其他可能危及您的账号安全的情形时，您应当立即以有效方式通知，要求暂停相关服务。您理解对您的请求采取行动需要合理时间，对在采取行动前已经产生的后果（包括但不限于您的任何损失）不承担任何责任。
      </View>
      <View className={styles.li}>除非有法律依据且征得的同意，否则，您的用户名和密码不得以任何方式转让、赠与或继承（与账号相关的财产权益除外）。

      </View>
      <View className={styles.li}>如需注销您的账号，请登录网站并进入个人中心，账号注销菜单输入手机号和验证码即可完成注销。会员一旦注销，您的所有信息将会被删除并无法恢复，建议您慎重考虑！


      </View>
      <View className={styles.li}>4、使用条款
      </View>
      <View className={styles.li}>用户在使用本服务或者网站、小程序服务时，应遵守国家《计算机信息系统国际联网保密管理规定》、《中华人民共和国计算机信息系统安全保护条例》、《计算机信息网络国际联网安全保护管理办法》等相关法律法规以及本协议规定、的相关协议及规则，禁止任何违法违规行为，如：
      </View>
      <View className={styles.li}>任何干扰或破坏触屏端、小程序或与之相连的服务器和网络及从事其他干扰或破坏服务的活动，将本服务或者网站、小程序作任何非法用途；
      </View>
      <View className={styles.li}>通过本服务或者网站、小程序发布、传播含有以下内容的信息:

      </View>
      <View className={styles.li}>(1) 有关宗教、种族或性别等的贬损言辞；(2) 侵犯党和国家利益的言论；骚扰、滥用或威胁其他用户的信息、广告信息；
      </View>
      <View className={styles.li}>(3) 侵犯任何第三方著作权、专利、商标、商业秘密或其他专有权利或名誉权的信息；
      </View>
      <View className={styles.li}>(4) 其他任何违反国家相关法律法规的信息。


      </View>
      <View className={styles.li}>5、费用
      </View>
      <View className={styles.li}>注册的会员及使用相应服务是免费的。 不负责对您因使用的本服务或者网站、小程序服务而需支付的软硬件、税收及其他费用。


      </View>
      <View className={styles.li}>6、责任声明
      </View>
      <View className={styles.li}>对使用本服务或者网站、小程序而产生的风险由用户自己承担，明确不提供任何明示或者默示的担保。
      </View>
      <View className={styles.li}>对下列事项不作任何陈述与保证：
      </View>
      <View className={styles.li}>您使用的服务后所产生的任何行为，如购买或获得的任何产品、服务、信息或其他事物等，将符合您的要求或经验；
      </View>
      <View className={styles.li}>是不受干扰的、没有故障的，也不对使用效果做任何保证。您同意独立承担因网站意外中断、操作或传输的迟延、电脑病毒、网络连接故障、未经授权的进入等引起的损失。
      </View>
      <View className={styles.li}>您因违反的用户协议或其他有关的法律、法规，而导致有第三方对提起诉讼或索赔要求时，您同意赔偿因此遭受的所有损失，包括但不限于合理的律师费。
      </View>
      <View className={styles.li}>用户对通过获取的任何信息，用户需自己甄别，自负风险；对因下载或引用的数据、信息而造成的用户计算机系统损坏或数据丢失，不负责任。
      </View>
      <View className={styles.li}>对用户使用上公布的或其服务中的建议和资讯而造成的损失或伤害以及用户相信上的公布的或其服务中的建议和资讯而做出的决定或采取的行动不负责任。若您对提供的部分或所有服务不满，您唯一的补救措施是停止使用这些服务。
      </View>
      <View className={styles.li}>含有与其他网站的链接。与链接的网站有合作关系，但并不能控制这些网站及其所提供的资源，所以对链接网站上的内容、广告、服务、产品信息的真实有效性不负责任，并且对因链接网站上的内容、广告、服务、产品信息的失实而造成的损失不负任何法律责任。
      </View>
      <View className={styles.li}>鉴于互联网的特殊性，因黑客攻击、互联网连通中断或者系统故障等情形给用户造成的损失，不承担责任。


      </View>
      <View className={styles.li}>7、知识产权声明
      </View>
      <View className={styles.li}>本服务或者网站、小程序上所有可阅读的资料等都受到《中华人民共和国著作权法》等的法律保护。
      </View>
      <View className={styles.li}>本服务或者网站、小程序上所有内容的选材、整理、编排、排版，以及由创作的文字、图片等作品的著作权，无论是否明示，均属所有。任何组织或个人未经书面许可，不得修改、出版、传播、参与传播、销售、制作衍生作品，或以其他任何方式使用整体或部分的本服务或者网站、小程序上的内容。
      </View>
      <View className={styles.li}>对其开发或者合作开发的系统等享有知识产权。的所有权利受法律保护。
      </View>
      <View className={styles.li}>所有其他在本服务或者网站、小程序上出现的商标为它们各自的权利人所有。
      </View>
      <View className={styles.li}>尊重和保护他人的知识产权。不允许在没有著作权、商标权或其他专有权权利人明确许可的情况下，发布或者传播任何可能侵犯他人权利的信息、图片。行为人承担由此产生的全部责任。


      </View>
      <View className={styles.li}>八、协议终止
      </View>
      <View className={styles.li}>您同意：出现以下情形，有权在告知或未经告知的情况下中止或终止向您提供部分或全部服务，暂时冻结或永久冻结（注销）您的账号，且无须因此向您或任何第三方承担任何责任，且保留追究您法律责任的权利：
      </View>
      <View className={styles.li}>您向提供的信息或资料不真实、不准确、不即时、不完整；
      </View>
      <View className={styles.li}>实施或计划实施破坏、攻击的电脑、移动端系统、网络的完整性，或者试图擅自进入的电脑、移动端系统、网络；
      </View>
      <View className={styles.li}>使用或提供含有毁坏、干扰、截取或侵占任何系统、数据或个人资料的任何电脑、移动端病毒、伪装破坏程序、电脑蠕虫、定时程序炸弹或其他破坏性程序；
      </View>
      <View className={styles.li}>盗用他人在本服务或者网站、小程序上的用户名或密码；
      </View>
      <View className={styles.li}>未经书面同意，擅自允许他人使用的服务（包括但不限于擅自允许他人使用其用户名或密码，或者擅自将其用户名或密码转让给他人的），或者通过本服务或者网站、小程序获得相关信息。
      </View>
      <View className={styles.li}>出现其他任何违法、违纪或违约的情形。
      </View>
      <View className={styles.li}>对您在会员资格或服务中止或终止前的行为，保留追究您法律责任的权利。
      </View>
    </View >
  );
};

export default ServiceAgreement;